Revit 2024 API
ParameterTypeId.EnergyAnalysisMasszoneUseenergydatasettings Property
 "Use Energy Data"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisMasszoneUseenergydatasettings { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisMasszoneUseenergydatasettings As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisMasszoneUseenergydatasettings {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace